# GetThemeName Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIThemeManager..::..GetThemeName Method
UIThemeManager Class See Also
---
Gets the theme name for the given theme type.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static string GetThemeName(
	UITheme frameTheme
)
```

Visual Basic
---
```text
Public Shared Function GetThemeName ( _
	frameTheme As UITheme _
) As String
```

Visual C++
---
```text
public:
static String^ GetThemeName(
	UITheme frameTheme
)
```

# ### Parameters
frameTheme
    Type: Autodesk.Revit.UI..::..UITheme The theme.
# ### Return Value
The name of the theme.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
UIThemeManager Class
Autodesk.Revit.UI Namespace